swak4Foam/Examples/groovyBC/pulsedPitzDaily/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        //        type            fixedValue;
        type            groovyTotalPressure;
        value           uniform 0;
        gamma 0;
        variables (
            "base=0.;"
            "maxP{}=max(p);"
            "minP{}=min(p);"
            "yp=pts().y;"
            "minY=min(yp);"
            "maxY=max(yp);"
            "scale=0.1*(maxP-minP)/(maxY-minY);"
        );
        p0 $value;
        p0Expression "base+scale*(pos().y-minY)";
    }

    upperWall
    {
        type            zeroGradient;
    }

    lowerWall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
